
from decimal import Decimal, getcontext
print(0.1 + 0.2 == 0.3)  # False 0.1 + 0.2 = 0.30000000000000004
print(0.1 + 0.2)

# Decimal — це клас у модулі decimal, який надає точні обчислення з плаваючою комою


print(Decimal("0.1") + Decimal("0.2") == Decimal("0.3"))  # True
print(Decimal("0.1") + Decimal("0.2"))

# Точність обчислень з Decimal контролюється через контекст
# Можна налаштувати загальну точність для всіх обчислень Decimal
# Тепер будь-які обчислення з Decimal будуть мати точність до чотирьох знаків після коми
getcontext().prec = 4

# 6 знаків після коми
getcontext().prec = 6
print(Decimal("1") / Decimal("7"))  # 0.142857

# 8 знаків після коми
getcontext().prec = 8
print(Decimal("1") / Decimal("7"))  # 0.14285714

# getcontext встановлює кількість значущих цифр
# значущими числами можуть бути і цифри перед комою

# Визначення значущих цифр:

# Усі ненульові цифри є значущими: 1, 2, 3, 4, 5, 6, 7, 8, 9.
# Нулі між ненульовими цифрами значущі: 102, 2005, 50009.
# Провідні нулі ніколи не бувають значущими: 0.02; 001.887; 0.000515.
# В числі з десятковою або без десяткової крапки знаходяться
# знакові нулі(праворуч від останньої ненульової цифри) за умови,
# якщо вони обґрунтовані точністю їх використання: 389.000; 2.02000; 5.400; 57.5400.

getcontext().prec = 28  # 28 значущих цифр по замовчуванню
print(Decimal("233") / Decimal("7"))  # 33.2857142857142857142857142857
getcontext().prec = 6
print(Decimal("233") / Decimal("7"))  # 33.2857
