# L - Local (Локальна): Це внутрішній рівень,
# де ім'я визначено всередині функції або блоку коду.

x = 50


def func() -> None:
    x = 2
    print('Зміна локального x на', x)  # Зміна локального x на 2


func()
print('Глобальний x як і раніше', x)  # x як і раніше 50

# E - Enclosing (Охоплювана): Це область видимості,
# яка охоплює локальну область видимості.
# Якщо функція знаходиться всередині іншої функції,
# імена, визначені в охоплюваній функції,
# будуть доступні для внутрішньої функції.


def outer_func():
    enclosing_var = "Я змінна в функції, що охоплює"

    def inner_func():
        print("Всередині вкладеної функції:", enclosing_var)

    inner_func()


outer_func()

# Тут enclosing_var є змінною в функції outer_func, що охоплює функцію inner_func.
# Вона доступна для читання в вкладеній функції inner_func,
# але не може бути змінена в inner_func без використання
# ключового слова nonlocal.


def func_outer():
    x = 2

    def func_inner():
        nonlocal x
        x = 5

    func_inner()
    return x


result = func_outer()  # 5

# G - Global (Глобальна): Це область видимості на рівні
# модуля або сценарію. Змінні, визначені на цьому рівні,
# доступні у всьому модулі.

x = 50


def func():
    global x
    print('x дорівнює', x)  # x дорівнює 50
    x = 2
    # Змінюємо глобальне значення x на 2
    print('Змінюємо глобальне значення x на', x)


func()
print('Значення x складає', x)  # Значення x складає 2

# щоб змінити глобальну змінну всередині функції,
# необхідно використовувати ключове слово global


# B - Built-in (Вбудована): Це самий зовнішній рівень, який
# містить імена, вбудовані в Python. Наприклад розглянуті
# нами вбудовані функції, len, range тощо.
