# @staticmethod - метод класу, який не потребує доступу до атрибутів класу
# або екземпляра класу. Цей метод може бути викликаний через ім'я класу.
# не мають доступу до екземпляру класу, тобто змінної self.

#  Цей метод не залежить від конкретного екземпляру класу
#  та може бути викликаний без створення об'єкта
class Geometry:
    PI = 3.14159

    @staticmethod
    def area_of_circle(radius):
        return Geometry.PI * radius ** 2


# метод може бути викликаний безпосередньо з класу без необхідності створення екземпляру класу
print(Geometry.area_of_circle(5))  # 78.53975
