morze_dict = {'A': '.-', 'B': '-...', 'C': '-.-.', 'D': '-..', 'E': '.', 'F': '..-.',
              'G': '--.', 'H': '....', 'I': '..', 'J': '.---', 'K': '-.-', 'L': '.-..',
              'M': '--', 'N': '-.', 'O': '---', 'P': '.--.', 'Q': '--.-', 'R': '.-.',
              'S': '...', 'T': '-', 'U': '..-', 'V': '...-', 'W': '.--', 'X': '-..-',
              'Y': '-.--', 'Z': '--..', '0': '-----', '1': '.----', '2': '..---',
              '3': '...--', '4': '....-', '5': '.....', '6': '-....', '7': '--...',
              '8': '---..', '9': '----.'}

# розробити програму, яка перетворює вхідний текстовий рядок на відповідний код мови Морзе
# Перетворення ключів словника на Unicode коди

# Функція ord() в Python - це вбудована функція, яка приймає символ
# і повертає його Unicode код, який є цілим числом.

table_morze_dict = {}
# для кожного ключа словника morze_dict використовуючи функцію ord(k)
# додає до словника table_morze_dict Unicode ключі
# та відповідні коди Морзе - значеннями
for k, v in morze_dict.items():
    table_morze_dict[ord(k)] = v
    print(table_morze_dict)
string = "Hello world"

result = ""

# перетворюємо рядок string в рядок result але вже азбукою Морзе
for ch in string:
    result = result + ch.upper().translate(table_morze_dict)

print(result)  # .... . .-.. .-.. --- / .-- --- .-. .-.. -..

# Ми виконуємо ініціалізацію змінної result для зберігання результату.
# Після цикл for проходить по кожному символу рядка string.
# За допомоги методу ch.upper() перетворюємо символ у верхній регістр,
# щоб відповідати ключам у таблиці table_morze_dict.
# Метод translate(table_morze_dict) використовується для заміни
# кожного символу його відповідником у мові Морзе згідно з
# таблицею table_morze_dict. Результат додається до result.

# В кінці виконання коду змінна result містить перетворений рядок
# у мові Морзе, який виводиться на екран.
